app/views/adservice/dashboard.html.erb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."guid" = 'c9d2a991-1eef-451a-8db4-41a676c8545d' LIMIT 1
SELECT "serviceinsts".* FROM "serviceinsts" WHERE "serviceinsts"."name" = 'sql' AND "serviceinsts"."org" = '0307' ORDER BY "serviceinsts"."id" ASC LIMIT 1
---
          <% @oksers=@userclient.service_instances_by_name oklist.name %>
          <% @account=Account.find_by_guid oklist.userguid %>
          <% @serinst=Serviceinst.where({:name=>oklist.name,:org=>@account.organization}).first %>