app/views/adapplications/service.html.erb

                                <td>
                                  <% @ser=Serviceinst.find_by_serviceguid bind.service_instance.guid %>
---
SELECT "serviceinsts".* FROM "serviceinsts" WHERE "serviceinsts"."serviceguid" = 'f209992b-e4c1-4890-9a5a-1e4ec0fab0d8' LIMIT 1