app/views/adaccount/manage.html.erb

				<%@orgs.each do |org|%>
                <%@theacc=Account.find_by_organization org.name%>
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."organization" = '0307' LIMIT 1