app/views/service/applylist.html.erb

SELECT "serviceinsts".* FROM "serviceinsts" WHERE "serviceinsts"."name" = 'sql' AND "serviceinsts"."org" = '0307' ORDER BY "serviceinsts"."id" ASC LIMIT 1
---
            <% @oksers=@userclient.service_instances_by_name oklist.name %>
            <% @serinst=Serviceinst.where({:name=>oklist.name,:org=>@account.organization}).first %>