app/views/service/manage.html.erb

SELECT "servicelists".* FROM "servicelists" WHERE "servicelists"."username" = '307@ebupt.com' AND "servicelists"."name" = 'sql' ORDER BY "servicelists"."id" ASC LIMIT 1
---
        <tr>
          <% serlist=Servicelist.where({:username=>@account.email,:name=>serinst.name}).first %>