app/controllers/adaccount_controller.rb

  def dashboard
    @orgs=Orglocal.all
---
SELECT "orglocals".* FROM "orglocals"

  def manage
	  @orgs=Orglocal.all
---
SELECT "orglocals".* FROM "orglocals"

  def unitaccount
    id=params[:id]
    @thisorg=Orglocal.find_by_id id
    @userclient=session[:userclient]
    @org=@userclient.organization_by_name @thisorg.name
    @account=Account.new
    @thisaccount=Account.find_by_organization @org.name
    @apps=App.find_by_org    @org.name
    @serinsts=Serviceinst.find_by_org @org.name
---
SELECT "orglocals".* FROM "orglocals" WHERE "orglocals"."id" = 2 LIMIT 1
SELECT "accounts".* FROM "accounts" WHERE "accounts"."organization" = '0307' LIMIT 1
SELECT "apps".* FROM "apps" WHERE "apps"."org" = '0307' LIMIT 1
SELECT "serviceinsts".* FROM "serviceinsts" WHERE "serviceinsts"."org" = '0307' LIMIT 1