app/controllers/adapplications_controller.rb

SELECT "apps".* FROM "apps"
SELECT "serviceinsts".* FROM "serviceinsts"
SELECT "apps".* FROM "apps" ORDER BY "apps"."updated_at" DESC LIMIT 4
SELECT "serviceinsts".* FROM "serviceinsts" ORDER BY "serviceinsts"."updated_at" DESC LIMIT 4
---
  def dashboard
    @userclient=session[:userclient]
    @allapps=App.all
    @allsers=Serviceinst.all
    @preapps = App.order(updated_at: :desc) \
         .limit(4) \
         .all
    @presers = Serviceinst.order(updated_at: :desc) \
         .limit(4) \
         .all

SELECT "apps".* FROM "apps"
---
  def manage
    @userclient=session[:userclient]
    @allapps=App.all

SELECT "apps".* FROM "apps"
---
  def service
    @userclient=session[:userclient]
    @locapps=App.all

SELECT "apps".* FROM "apps" WHERE "apps"."id" = 3 LIMIT 1
---
  def unitapp
    @userclient=session[:userclient]
    appid=params[:id]
    @locapp=App.find_by_id appid