app/controllers/adservice_controller.rb

SELECT "servicelists".* FROM "servicelists" WHERE "servicelists"."active" = 't'
SELECT "servicelists".* FROM "servicelists" WHERE "servicelists"."active" = 'f' AND "servicelists"."isrej" = 'no'
---
  def dashboard
    @userclient=session[:userclient]
    @oklists=Servicelist.where({:active=>true}).all
    @waitlists=Servicelist.where({:active=>false,:isrej=>"no"}).all

SELECT "serviceinsts".* FROM "serviceinsts"
---
  def manage
    @userclient=session[:userclient]
    @allsers=Serviceinst.all

SELECT "serviceinsts".* FROM "serviceinsts" WHERE "serviceinsts"."id" = 2 ORDER BY "serviceinsts"."id" ASC LIMIT 1
SELECT "servicelists".* FROM "servicelists" WHERE "servicelists"."name" = 'sql' AND "servicelists"."username" = '307@ebupt.com' AND "servicelists"."type" = 'p-mysql-local' ORDER BY "servicelists"."id" ASC LIMIT 1
---
  def viewmysql
    @userclient=session[:userclient]
    serid=params[:id]
    @serinst=Serviceinst.where({:id=>serid}).first
    @ses=@userclient.service_instances_by_name @serinst.name
    @ses.each do |se|
      if se.guid==@serinst.serviceguid
        @thisser=se
      end
    end
    @serlist=Servicelist.where({:name=>@serinst.name,:username=>@serinst.username,:type=>@serinst.sertype}).first

SELECT "servicelists".* FROM "servicelists" WHERE "servicelists"."id" = 4 LIMIT 1
UPDATE "servicelists" SET "reject_at" = ?, "isrej" = ?, "updated_at" = ? WHERE "servicelists"."id" = 4  [["reject_at", Thu, 13 Mar 2014 14:01:15 CST +08:00], ["isrej", "yes"], ["updated_at", Thu, 13 Mar 2014 14:01:15 CST +08:00]]
---
  def rejser
    serlistid=params[:id]
    @serlist=Servicelist.find_by_id serlistid
    @serlist.reject_at= Time.now
    @serlist.isrej="yes"
    @serlist.save