app/controllers/applications_controller.rb

  def dashboard
    curemail=session[:useremail]
    @userclient=session[:userclient]
    @account=Account.find_by_email curemail
    @org=@userclient.organization_by_user_guid @account.guid
    #@apps=App.find_by_userguid @account.guid
    @apps=App.where({userguid:@account.guid}).all
    #@serinsts=Serviceinst.find_by_userguid @account.guid
    @serinsts=Serviceinst.where({userguid:@account.guid}).all
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."email" = '307@ebupt.com' LIMIT 1
SELECT "apps".* FROM "apps" WHERE "apps"."userguid" = 'c9d2a991-1eef-451a-8db4-41a676c8545d'
SELECT "serviceinsts".* FROM "serviceinsts" WHERE "serviceinsts"."userguid" = 'c9d2a991-1eef-451a-8db4-41a676c8545d'

  def manage
    curemail=session[:useremail]
    @userclient=session[:userclient]
    @account=Account.find_by_email curemail
    @org=@userclient.organization_by_user_guid @account.guid
   # selector={userguid=>@account.guid}
    @apps=App.where({:userguid=>@account.guid}).all
    @appcodes=Appcode.where({:username=>curemail}).all
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."email" = '307@ebupt.com' LIMIT 1
SELECT "apps".* FROM "apps" WHERE "apps"."userguid" = 'c9d2a991-1eef-451a-8db4-41a676c8545d'
SELECT "appcodes".* FROM "appcodes" WHERE "appcodes"."username" = '307@ebupt.com'

  def service
    curemail=session[:useremail]
    @userclient=session[:userclient]
    @account=Account.find_by_email curemail
    @binds=@userclient.service_bindings
    @allser=Serviceinst.where({:username=>curemail}).all
    @allapp=App.where({:userguid=>@account.guid}).all
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."email" = '307@ebupt.com' LIMIT 1
SELECT "serviceinsts".* FROM "serviceinsts" WHERE "serviceinsts"."username" = '307@ebupt.com'
SELECT "apps".* FROM "apps" WHERE "apps"."userguid" = 'c9d2a991-1eef-451a-8db4-41a676c8545d'

  def unitapp
    curemail=session[:useremail]
    @userclient=session[:userclient]
    appid=params[:id]
    puts "*********************"+appid
    @app=App.find_by_id appid
    puts "*********************"+@app.appname
    @cfapp=@userclient.app_by_name @app.appname
    @avidomains=@cfapp.summary[:available_domains]
    @account=Account.find_by_email curemail
    @org=@userclient.organization_by_user_guid @account.guid
    @appcodes=Appcode.where({appguid:@app.appguid}).all
---
SELECT "apps".* FROM "apps" WHERE "apps"."id" = 3 LIMIT 1
SELECT "accounts".* FROM "accounts" WHERE "accounts"."email" = '307@ebupt.com' LIMIT 1
SELECT "appcodes".* FROM "appcodes" WHERE "appcodes"."appguid" = '34d9e918-b982-48c2-a28a-ab48989d5ba3'

  def uploadcode
    @userclient=session[:userclient]
    appid=params[:appid]
    curemail=session[:useremail]
    @app=App.find_by_id appid
---
SELECT "apps".* FROM "apps" WHERE "apps"."id" = 4 LIMIT 1

  def creapplication
    curemail=session[:useremail]
    @account=Account.find_by_email curemail
    @apname=params[:appname]
    @apinnum=params[:appinsnum]
    @apsize=params[:appsize]
    #@apname="testapp2"
    #@apinnum="2"
    #@apspname="0"
    #@apsize="64"
    @userclient=session[:userclient]
    @space=@userclient.organizations[0].spaces[0]
    begin
      @app=initapp @userclient, @apname, @apinnum, @space, @apsize
      @newapp = App.new
      @newapp.username=session[:email]
      @newapp.userguid=@account.guid
      @newapp.appguid=@app.guid
      @newapp.active=false
      @newapp.appname=@apname
      @newapp.org=@userclient.organizations[0].name
      @newapp.space= @space.name
      @newapp.hascode="0"
      @newapp.save
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."email" = '307@ebupt.com' LIMIT 1
INSERT INTO "apps" ("active", "appguid", "appname", "created_at", "hascode", "org", "space", "updated_at", "userguid") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def deleteapp
    curemail=session[:useremail]
    @userclient=session[:userclient]
    @account=Account.find_by_email curemail
    @locapp=App.find_by_id params[:appid]
    @cfapp=@userclient.app_by_name @locapp.appname
    puts "-----------------"
    puts @cfapp.guid
    begin
    to_deleted_routes = @cfapp.routes
    to_deleted_routes.each { |r|
      r.delete!
    }
    #unbind service
    service_instances = @cfapp.services
    service_instances.each { |si|
      @cfapp.unbind si
    }
    @appcodes=Appcode.where({:appguid=>@locapp.appguid}).all
    @appcodes.each do |code|
      @path="#{Rails.root}/public/userdata/"+session[:useremail].to_s+"/"+code.zipname
      File.delete(@path.to_s)
      code.destroy
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."email" = '307@ebupt.com' LIMIT 1
SELECT "apps".* FROM "apps" WHERE "apps"."id" = 4 LIMIT 1
SELECT "appcodes".* FROM "appcodes" WHERE "appcodes"."appguid" = '5c891f09-6379-4be5-bb6a-e4f3bcefca09'
DELETE FROM "appcodes" WHERE "appcodes"."id" = ?  [["id", 22]]
DELETE FROM "apps" WHERE "apps"."id" = ?  [["id", 5]]

  def appbindser
    curemail=session[:useremail]
    @userclient=session[:userclient]
    @account=Account.find_by_email curemail
    serid=params[:serid]
    appid=params[:appid]
    @locser=Serviceinst.find_by_id serid
    @locapp=App.find_by_id appid
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."email" = '307@ebupt.com' LIMIT 1
SELECT "serviceinsts".* FROM "serviceinsts" WHERE "serviceinsts"."id" = 3 LIMIT 1
SELECT "apps".* FROM "apps" WHERE "apps"."id" = 3 LIMIT 1

  def unbind
    appid=params[:appid]
    curemail=session[:useremail]
    @userclient=session[:userclient]
    @account=Account.find_by_email curemail
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."email" = '307@ebupt.com' LIMIT 1

  def addroute
    @hostname=params[:hostname]
    @domainname=params[:domainname]
    @userclient=session[:userclient]
    appid=params[:appid]
    @app=App.find_by_id appid
---
SELECT "apps".* FROM "apps" WHERE "apps"."id" = 4 LIMIT 1