app/controllers/service_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."email" = '307@ebupt.com' LIMIT 1
SELECT "servicelists".* FROM "servicelists" WHERE "servicelists"."userguid" = 'c9d2a991-1eef-451a-8db4-41a676c8545d' AND "servicelists"."active" = 't'
SELECT "servicelists".* FROM "servicelists" WHERE "servicelists"."userguid" = 'c9d2a991-1eef-451a-8db4-41a676c8545d' AND "servicelists"."active" = 'f' AND "servicelists"."isrej" = 'no'
---
  def applylist
    @userclient=session[:userclient]
    curemail=session[:useremail]
    @account=Account.find_by_email curemail
    @oklists=Servicelist.where({:userguid=>@account.guid,:active=>true}).all
    @waitlists=Servicelist.where({:userguid=>@account.guid,:active=>false,:isrej=>"no"}).all

SELECT "accounts".* FROM "accounts" WHERE "accounts"."email" = '307@ebupt.com' LIMIT 1
SELECT "serviceinsts".* FROM "serviceinsts" WHERE "serviceinsts"."username" = '307@ebupt.com'
---
  def manage
    @userclient=session[:userclient]
    curemail=session[:useremail]
    @account=Account.find_by_email curemail
    @serinsts=Serviceinst.where({:username=>curemail}).all

SELECT "serviceinsts".* FROM "serviceinsts" WHERE "serviceinsts"."id" = 2 LIMIT 1
SELECT "servicelists".* FROM "servicelists" WHERE "servicelists"."username" = '307@ebupt.com' AND "servicelists"."name" = 'sql' ORDER BY "servicelists"."id" ASC LIMIT 1
DELETE FROM "serviceinsts" WHERE "serviceinsts"."id" = ?  [["id", 2]]
---
  def deleteser
    @userclient=session[:userclient]
    begin
    @serinst=Serviceinst.find_by_id params[:serid]
    @ses=@userclient.service_instances_by_name @serinst.name
    @ses.each do |se|
      if se.guid==@serinst.serviceguid
        @thisser=se
      end
    end
    @bindings=@thisser.service_bindings
    @bindings.each do |binding|
      @app = binding.app
      @app.unbind @thisser
    end
    @thisser.delete!
<<<<<<< HEAD
    log="用户删除服务"+@serinst.name+",服务类型为"+@serinst.sertype
    user=session[:useremail]
    createlog user,log
=======
>>>>>>> e582676e82b04eeed2cf6322a8b13e3b25c94fbb
    @serlist=Servicelist.where({:username=>@serinst.username,:name=>@serinst.name}).first
    @serlist.isdelete="yes"
    @serlist.save
    @serinst.destroy

SELECT "accounts".* FROM "accounts" WHERE "accounts"."email" = '307@ebupt.com' LIMIT 1
INSERT INTO "servicelists" ("active", "apply_at", "created_at", "name", "plan", "type", "updated_at", "userguid", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "serviceinsts" ("approvetime", "created_at", "name", "org", "plan", "sertype", "serviceguid", "space", "updated_at", "userguid", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def addmysql
    @userclient=session[:userclient]
    curemail=session[:useremail]
    @account=Account.find_by_email curemail
    @sername=params[:sername]
    type=params[:mysqltype]
    if type=="1"
      @planid=0
      @service=@userclient.services[0]
      an_list=Servicelist.new(
          :userguid=>@account.guid,
          :username=>@account.email,
          :name=>@sername,
          :type=>@service.label.to_s,
          :plan=>@planid,
          :apply_at=>Time.now,
          :active=>false,
          :isrej=>"no")
      an_list.save
      @serint=@userclient.managed_service_instance
      @serint.name=@sername
      @serint.space= @userclient.organizations[0].spaces[0]
      @serint.service_plan= @service.service_plans[@planid.to_i]
      @serint.create!

SELECT "accounts".* FROM "accounts" WHERE "accounts"."email" = '307@ebupt.com' LIMIT 1
SELECT "serviceinsts".* FROM "serviceinsts" WHERE "serviceinsts"."name" IS NULL AND "serviceinsts"."org" = '0307' ORDER BY "serviceinsts"."id" ASC LIMIT 1
SELECT "servicelists".* FROM "servicelists" WHERE "servicelists"."name" = 'sql' AND "servicelists"."username" = '307@ebupt.com' AND "servicelists"."type" = 'p-mysql-local' ORDER BY "servicelists"."id" ASC LIMIT 1
---
  def viewmysql
    @userclient=session[:userclient]
    curemail=session[:useremail]
    @account=Account.find_by_email curemail
    sername=params[:name]
    @serinst=Serviceinst.where({:name=>sername,:org=>@account.organization}).first
    @ses=@userclient.service_instances_by_name sername
    @ses.each do |se|
      if se.guid==@serinst.serviceguid
        @thisser=se
      end
    end
    @serlist=Servicelist.where({:name=>sername,:username=>curemail,:type=>@serinst.sertype}).first